fangzhenhu/GraduationStm32/Stm32lib/src_base/ili9320.c
  b = (c>>0)  & 0x1f;
  g = (c>>5)  & 0x3f;
  r = (c>>11) & 0x1f;
  
  rgb =  (b<<11) + (g<<5) + (r<<0);

  return( rgb );
}

/****************************************************************************
* 名    称：void ili9320_BackLight(u8 status)
* 功    能：开、关液晶背光
* 入口参数：status     1:背光开  0:背光关
* 出口参数：无
* 说    明：
* 调用方法：ili9320_BackLight(1);
****************************************************************************/
void ili9320_BackLight(u8 status)
{
  if ( status >= 1 )
  {
    Lcd_Light_ON;
  }
  else
  {
    Lcd_Light_OFF;
  }
}

/****************************************************************************
* 名    称：void ili9320_Delay(vu32 nCount)
* 功    能：延时
* 入口参数：nCount   延时值
* 出口参数：无
* 说    明：
* 调用方法：ili9320_Delay(1000);
****************************************************************************/
void ili9320_Delay(vu32 nCount)
{
  // Delay(nCount);
	delay_ms(nCount);
  //for(; nCount != 0; nCount--);
}


//  if ( (x>320)||(y>240) ) return;
//  ili9320_SetCursor(x,y);
//
//  LCD_WriteRAM_Prepare();
//  LCD_WriteRAM(point);
/**
  * @brief  Draws a character on LCD.
  * @param  Xpos: the Line where to display the character shape.
  * @param  Ypos: start column address.
  * @param  c: pointer to the character data.
  * @retval None
  */
void LCD_DrawChar(uint16_t Xpos, uint16_t Ypos, const uint8_t *cpFontArray)
{
    uint32_t index = 0, i = 0, j = 0, k = 0, y;
    uint8_t Xaddress = 0;
/**************** Armjishu.com Add { *************************************/
	uint32_t  Width = 24;
	uint32_t  Height = 48;
	uint32_t  BytesPreChar = 144;
/**************** Armjishu.com Add } *************************************/	 
    Xaddress = Xpos;

    ili9320_SetCursor(Xaddress, Ypos);

    for(y = 0; y < Height; y++)
    {
        LCD_WriteRAM_Prepare(); 
        for(i = Width; i > 0;)
        {
            if(i>=8)
            {
                k = 8;
            }
            else
            {
                k = i;
            }

            for(j = 0; j < k; j++)
            {
                if((cpFontArray[index] & (0x80 >> j)) == 0x00)
                {
                    if(HyalineBack == HyalineBackDis)
                    {
                        LCD_WriteRAM(BackColor); //putchar(' ');
                    }
                    else
                    {
                        LCD_SetCursor(Xaddress, Ypos+(Width - i)+1);
                        LCD_WriteRAM_Prepare();
                    }
                }
                else
                {
                    LCD_WriteRAM(TextColor); //putchar('*');
                }
                i--;
                //Delay(2);//此处加延迟可以清楚的看到组成字符的一个个的点绘制过程
            }
            index++;
        }   
        //SetCs
        Xaddress++;
        ili9320_SetCursor(Xaddress, Ypos);
    }
    //putchar('\r');putchar('\n');
}
